---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SystemsAnalysisReportStyle
source: html/266b5ecd-5b6e-7e95-fa00-10886279f621.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SystemsAnalysisReportStyle Property

"Report Style"

## Syntax (C#)
```csharp
public static ForgeTypeId SystemsAnalysisReportStyle { get; }
```